///////////////////////////////////////////////////////////////////////////////
//Напишите функцию, которая
// - называется Factorial
// - возвращает int
// - принимает int и возвращает факториал своего аргумента.
//Гарантируется, что аргумент функции по модулю не превышает 10.
//Для отрицательных аргументов функция должна возвращать 1.
///////////////////////////////////////////////////////////////////////////////

#include <iostream>
using namespace std;

int Factorial(int x){
    if (x < 1) {
        return 1;
    } else {
        x = x * (Factorial((x - 1)));
        return x;
    }
}

int main() {
    int y;
    cin >> y;
    cout << Factorial(y);
    return 0;
}
