///////////////////////////////////////////////////////////////////////////////
//Дана строка. Найдите в этой строке второе вхождение буквы f и выведите
//индекс этого вхождения. Если буква f в данной строке встречается только
//один раз, выведите число -1, а если не встречается ни разу,
//выведите число -2. Индексы нумеруются с нуля.
//Дана строка. Найдите в этой строке второе вхождение буквы f и выведите
///////////////////////////////////////////////////////////////////////////////

#include <iostream>
#include <string>

using namespace std;


int main() {
    int n = 0, i = 0;
    string s;
    cin >> s;

    while (i < s.size()) {
        if (s[i] == 'f') {
            n += 1;
        }
        if (n == 2) {
            cout << i;
            break;
        }
        i += 1;
    }
    if (n == 1) {
        cout << "-1";
    } else if (n == 0) {
        cout << "-2";
    }

    return 0;
}
